// SOURCE: https://www.srbvoz.rs/wp-content/redvoznje/rv_bg_voza_za_2025.pdf
import {
  TrainIdDirection1,
  TrainIdDirection2,
  StationName,
  StationNameDisplay,
  ServiceFrequency,
} from "train-schedule-types";

type ARouteExtractedData = {
  stationNames: StationName[];
  timetableDataDirection1: string;
  timetableDataDirection2: string;
  trainIdsDirection1: TrainIdDirection1[];
  trainIdsDirection2: TrainIdDirection2[];
  serviceFrequencyDirection1: ServiceFrequency[];
  serviceFrequencyDirection2: ServiceFrequency[];
}

export const year = 2026;

export const holidays = [
  `${year}-01-01`,
  `${year}-01-02`,
  `${year}-01-07`,
  `${year}-02-15`,
  `${year}-02-16`,
  `${year}-02-17`,
  `${year}-04-10`,
  `${year}-04-12`,
  `${year}-04-13`,
  `${year}-05-01`,
  `${year}-05-02`,
  `${year}-11-11`,
];

// zeros were entered manually to denote no departure
// the pdf contains timetables for some subroutes which were merged appropriately to reduce redundancy
// Train from and to Lazarevac sometimes passes Barajevo ukr. without stopping so that is marked distinctly (not with 0!). Currently marked with `8.8` - MUST be a number or data shapers won't work properly!

export const batajnicaOvca: ARouteExtractedData = {
  stationNames: ["batajnica", "kamendin", "zemunsko polje", "altina", "zemun", "tosin bunar", "novi beograd", "beograd centar", "karadjordjev park", "vukov spomenik", "pancevacki most", "krnjaca most", "krnjaca ukr", "sebes", "ovca"],
  timetableDataDirection1: "Батајница 6.00 6.30 7.10 7.30 8.00 8.30 8.57 9.30 10.10 11.20 12.00 12.35 14.00 14.30 15.10 15.30 16.00 16.30 17.10 17.30 18.30 19.10 20.00 Камендин стајалиште 6.04 6.34 7.14 7.34 8.04 8.34 9.01 9.34 10.14 11.24 12.04 12.39 14.04 14.34 15.14 15.34 16.04 16.34 17.14 17.34 18.34 19.14 20.04 Земунско поље 6.06 6.36 7.16 7.36 8.06 8.36 9.03 9.36 10.16 11.26 12.06 12.41 14.06 14.36 15.16 15.36 16.06 16.36 17.16 17.36 18.36 19.16 20.06 Алтина стајалиште 6.08 6.38 7.18 7.38 8.08 8.38 9.05 9.38 10.18 11.28 12.08 12.43 14.08 14.38 15.18 15.38 16.08 16.38 17.18 17.38 18.38 19.18 20.08 Земун 6.12 6.42 7.22 7.42 8.12 8.42 9.18 9.42 10.22 11.32 12.12 12.47 14.12 14.42 15.22 15.42 16.12 16.42 17.22 17.42 18.42 19.22 20.12 Тошин бунар стај. 6.16 6.46 7.26 7.46 8.16 8.46 9.22 9.46 10.26 11.36 12.16 12.51 14.16 14.46 15.26 15.46 16.16 16.46 17.26 17.46 18.46 19.26 20.16 Нови Београд 6.19 6.49 7.29 7.49 8.19 8.49 9.25 9.49 10.29 11.39 12.19 12.54 14.19 14.49 15.29 15.49 16.19 16.49 17.29 17.49 18.49 19.29 20.19 Београд Центар 6.23 6.53 7.33 7.53 8.23 8.53 9.29 9.53 10.33 11.43 12.23 12.58 14.23 14.53 15.33 15.53 16.23 16.53 17.33 17.53 18.53 19.33 20.23 Карађорђев парк 6.27 6.57 7.37 7.57 8.27 8.57 9.33 9.57 10.37 11.47 12.27 13.02 14.27 14.57 15.37 15.57 16.27 16.57 17.37 17.57 18.57 19.37 20.27 Вуков споменик 6.31 7.01 7.41 8.01 8.31 9.01 9.37 10.01 10.41 11.51 12.31 13.06 14.31 15.01 15.41 16.01 16.31 17.01 17.41 18.01 19.01 19.41 20.31 Панчевачки мост 6.35 7.05 7.45 8.05 8.35 9.05 9.41 10.05 10.45 11.55 12.35 13.10 14.35 15.05 15.45 16.05 16.35 17.05 17.45 18.05 19.05 19.45 20.35 Крњача мост 6.39 7.09 7.49 8.09 8.39 9.09 9.45 10.09 10.49 11.59 12.39 13.14 14.39 15.09 15.49 16.09 16.39 17.09 17.49 18.09 19.09 19.49 20.39 Крњача укр. 6.42 7.12 7.52 8.12 8.42 9.12 9.48 10.12 10.52 12.02 12.42 13.17 14.42 15.12 15.52 16.12 16.42 17.12 17.52 18.12 19.12 19.52 20.42 Себеш стај. 6.45 7.15 7.55 8.15 8.45 9.15 9.51 10.15 10.55 12.05 12.45 13.20 14.45 15.15 15.55 16.15 16.45 17.15 17.55 18.15 19.15 19.55 20.45 Овча 6.48 7.18 7.58 8.18 8.48 9.18 9.54 10.18 10.58 12.08 12.48 13.23 14.48 15.18 15.58 16.18 16.48 17.18 17.58 18.18 19.18 19.58 20.48",
  timetableDataDirection2: "Овча 5.40 6.10 6.40 7.10 7.40 8.10 8.40 9.10 9.50 10.50 11.20 12.10 13.10 13.50 14.40 15.10 15.40 16.20 16.40 17.10 17.50 18.40 19.10 19.40 20.20 21.10 22.35 Себеш стај. 5.44 6.14 6.44 7.14 7.44 8.14 8.44 9.14 9.54 10.54 11.24 12.14 13.14 13.54 14.44 15.14 15.44 16.24 16.44 17.14 17.54 18.44 19.14 19.44 20.24 21.14 22.39 Крњача укр. 5.48 6.18 6.48 7.18 7.48 8.18 8.48 9.18 9.58 10.58 11.28 12.18 13.18 13.58 14.48 15.18 15.48 16.28 16.48 17.18 17.58 18.48 19.18 19.48 20.28 21.18 22.43 Крњача мост 5.50 6.20 6.50 7.20 7.50 8.20 8.50 9.20 10.00 11.00 11.30 12.20 13.20 14.00 14.50 15.20 15.50 16.30 16.50 17.20 18.00 18.50 19.20 19.50 20.30 21.20 22.45 Панчевачки мост 5.56 6.26 6.56 7.26 7.56 8.26 8.56 9.26 10.06 11.06 11.36 12.26 13.26 14.06 14.56 15.26 15.56 16.36 16.56 17.26 18.06 18.56 19.26 19.56 20.36 21.26 22.51 Вуков споменик 5.59 6.29 6.59 7.29 7.59 8.29 8.59 9.29 10.09 11.09 11.39 12.29 13.29 14.09 14.59 15.29 15.59 16.39 16.59 17.29 18.09 18.59 19.29 19.59 20.39 21.29 22.54 Карађорђев парк 6.03 6.33 7.03 7.33 8.03 8.33 9.03 9.33 10.13 11.13 11.43 12.33 13.33 14.13 15.03 15.33 16.03 16.43 17.03 17.33 18.13 19.03 19.33 20.03 20.43 21.33 22.58 Београд Центар 6.06 6.36 7.06 7.36 8.06 8.36 9.06 9.36 10.16 11.16 11.46 12.36 13.36 14.16 15.06 15.36 16.06 16.46 17.06 17.36 18.16 19.06 19.36 20.06 20.46 21.36 23.01 Нови Београд 6.10 6.40 7.10 7.40 8.10 8.40 9.10 9.40 10.20 11.20 11.50 12.40 13.40 14.20 15.10 15.40 16.10 16.50 17.10 17.40 18.20 19.10 19.40 20.10 20.50 21.40 23.05 Тошин бунар стај. 6.13 6.43 7.13 7.43 8.13 8.43 9.13 9.43 10.23 11.23 11.53 12.43 13.43 14.23 15.13 15.43 16.13 16.53 17.13 17.43 18.23 19.13 19.43 20.13 20.53 21.43 23.08 Земун 6.17 6.47 7.17 7.47 8.17 8.47 9.17 9.47 10.27 11.27 11.56 12.47 13.47 14.27 15.17 15.47 16.17 16.57 17.17 17.47 18.27 19.16 19.47 20.17 20.57 21.47 23.11 Алтина стајалиште 6.20 6.50 7.20 7.50 8.20 8.50 9.20 9.50 10.30 11.30 0 12.50 13.50 14.30 15.20 15.50 16.20 17.00 17.20 17.50 18.30 0 19.50 20.20 21.00 21.50 0 Земунско поље 6.22 6.52 7.22 7.52 8.22 8.52 9.22 9.52 10.32 11.32 0 12.52 13.52 14.32 15.22 15.52 16.22 17.02 17.22 17.52 18.32 0 19.52 20.22 21.02 21.52 0 Камендин стајалиште 6.24 6.54 7.24 7.54 8.24 8.54 9.24 9.54 10.34 11.34 0 12.54 13.54 14.34 15.24 15.54 16.24 17.04 17.24 17.54 18.34 0 19.54 20.24 21.04 21.54 0 Батајница 6.28 6.58 7.28 7.58 8.28 8.58 9.28 9.58 10.38 11.38 0 12.58 13.58 14.38 15.28 15.58 16.28 17.08 17.28 17.58 18.38 0 19.58 20.28 21.08 21.58 0",
  trainIdsDirection1: [8001, 8003, 8005, 8007, 8009, 8011, 8013, 8015, 8017, 8019, 8021, 8023, 8025, 8027, 8029, 8031, 8033, 8035, 8037, 8039, 8041, 8043, 8045],
  trainIdsDirection2: [8000, 8002, 8004, 8006, 8008, 8010, 8012, 8014, 8016, 8018, 8020, 8022, 8024, 8026, 8028, 8030, 8032, 8034, 8036, 8038, 8040, 8042, 8044, 8046, 8048, 8050, 8340],
  serviceFrequencyDirection1: ["ed", "wd", "ed", "wd", "ed", "wd", "ed", "wd", "ed", "ed", "ed", "ed", "ed", "wd", "ed", "wd", "ed", "wd", "ed", "ed", "ed", "wd", "ed"],
  serviceFrequencyDirection2: ["wd", "ed", "wd", "ed", "wd", "ed", "wd", "ed", "ed", "ed", "wd", "ed", "ed", "ed", "wd", "ed", "wd", "ed", "wd", "ed", "ed", "wd", "ed", "ed", "wd", "ed", "ed"]
}

export const ovcaZemunResnikLazarevac: ARouteExtractedData = {
  stationNames: ["ovca", "sebes", "krnjaca ukr", "krnjaca most", "pancevacki most", "vukov spomenik", "karadjordjev park", "zemun", "tosin bunar", "novi beograd", "beograd centar", "rakovica", "knezevac", "kijevo", "resnik", "bela reka", "barajevo ukr", "barajevo centar", "veliki borak", "leskovac kolubarski", "stepojevac", "vreoci", "lazarevac"],
  timetableDataDirection1: "Овча 0 5.50 6.20 7.35 7.48 8.20 9.18 0 10.35 0 11.50 12.40 13.25 13.55 14.20 15.00 15.22 15.52 0 16.30 17.30 18.10 18.30 19.00 19.50 20.30 22.00 22.35 Себеш стај. 0 5.54 6.24 7.39 7.52 8.24 9.22 0 10.39 0 11.54 12.44 13.29 13.59 14.24 15.04 15.26 15.56 0 16.34 17.34 18.14 18.34 19.04 19.54 20.34 22.04 22.39 Крњача укр. 0 5.58 6.28 7.43 7.55 8.28 9.26 0 10.43 0 11.58 12.48 13.33 14.03 14.28 15.08 15.30 16.00 0 16.38 17.38 18.18 18.38 19.08 19.58 20.38 22.08 22.43 Крњача мост 0 6.00 6.30 7.45 7.57 8.30 9.28 0 10.45 0 12.00 12.50 13.35 14.05 14.30 15.10 15.32 16.02 0 16.40 17.40 18.20 18.40 19.10 20.00 20.40 22.10 22.45 Панчевачки мост 0 6.06 6.35 7.50 8.02 8.35 9.33 0 10.50 0 12.05 12.55 13.40 14.10 14.35 15.15 15.37 16.08 0 16.45 17.45 18.25 18.45 19.15 20.05 20.45 22.15 22.51 Вуков споменик 0 6.09 6.38 7.53 8.05 8.38 9.36 0 10.53 0 12.08 12.58 13.43 14.13 14.38 15.18 15.40 16.11 0 16.48 17.48 18.28 18.48 19.18 20.08 20.48 22.18 22.54 Карађорђев парк 0 6.12 6.41 7.56 8.08 8.41 9.39 0 10.56 0 12.11 13.01 13.46 14.16 14.41 15.21 15.43 16.14 0 16.51 17.51 18.31 18.51 19.21 20.11 20.51 22.21 22.57 Земун 4.10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 16.16 0 0 0 0 0 0 0 0 0 Тошин Бунар 4.13 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 16.20 0 0 0 0 0 0 0 0 0 Нови Београд 4.15 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 16.23 0 0 0 0 0 0 0 0 0 Београд Центар 4.20 0 0 0 0 0 0 10.40 0 11.40 0 0 0 0 0 0 0 0 16.27 0 0 0 0 0 0 0 0 23.01 Раковица 4.29 6.21 6.50 8.05 8.16 8.50 9.48 10.49 11.05 11.49 12.20 13.10 13.55 14.25 14.50 15.30 15.52 16.22 16.36 17.00 18.00 18.40 19.00 19.30 20.20 21.00 22.30 0 Кнежевац 4.32 6.24 6.53 8.08 8.19 8.53 9.51 10.52 11.08 11.52 12.23 13.13 13.58 14.28 14.53 15.33 15.55 16.25 16.39 17.03 18.03 18.43 19.03 19.33 20.23 21.03 22.33 0 Кијево стај. 4.34 6.26 6.55 8.10 8.21 8.55 9.53 10.54 11.10 11.54 12.25 13.15 14.00 14.30 14.55 15.35 15.57 16.27 16.41 17.05 18.05 18.45 19.05 19.35 20.25 21.05 22.35 0 Ресник 4.37 6.29 6.58 8.13 8.24 8.58 9.56 10.57 11.13 11.57 12.28 13.18 14.03 14.33 14.58 15.38 16.00 16.30 16.44 17.08 18.08 18.48 19.08 19.38 20.28 21.08 22.38 0 Бела река 4.47 6.48 0 0 8.33 0 0 0 0 0 12.40 0 0 0 0 0 16.12 0 16.54 0 0 0 19.18 0 0 0 0 0 Барајево укр. 8.8 6.59 0 0 8.8 0 0 0 0 0 8.8 0 0 0 0 0 16.18 0 8.8 0 0 0 19.24 0 0 0 0 0 Барајево Центар 4.55 7.02 0 0 8.41 0 0 0 0 0 12.48 0 0 0 0 0 16.20 0 17.02 0 0 0 19.26 0 0 0 0 0 Велики Борак 5.00 7.07 0 0 8.46 0 0 0 0 0 12.53 0 0 0 0 0 16.25 0 17.07 0 0 0 19.30 0 0 0 0 0 Лесковац Колубарски 5.03 7.10 0 0 8.49 0 0 0 0 0 12.56 0 0 0 0 0 16.28 0 17.10 0 0 0 19.33 0 0 0 0 0 Степојевац 5.07 7.13 0 0 8.53 0 0 0 0 0 13.00 0 0 0 0 0 16.31 0 17.12 0 0 0 19.36 0 0 0 0 0 Вреоци 5.14 7.27 0 0 9.00 0 0 0 0 0 13.07 0 0 0 0 0 16.37 0 17.26 0 0 0 19.48 0 0 0 0 0 Лазаревац 5.20 7.33 0 0 9.06 0 0 0 0 0 13.13 0 0 0 0 0 16.43 0 17.32 0 0 0 19.54 0 0 0 0 0",
  timetableDataDirection2: "Лазаревац 0 5.40 5.55 0 7.52 0 0 0 0 11.40 0 0 0 0 13.58 0 0 0 0 0 17.05 0 0 18.52 0 20.29 0 Вреоци 0 5.47 6.02 0 7.58 0 0 0 0 11.47 0 0 0 0 14.09 0 0 0 0 0 17.11 0 0 18.59 0 20.35 0 Степојевац 0 5.54 6.09 0 8.09 0 0 0 0 11.54 0 0 0 0 14.16 0 0 0 0 0 17.18 0 0 19.06 0 20.46 0 Лесковац Колубарски 0 5.57 6.12 0 8.11 0 0 0 0 11.57 0 0 0 0 14.19 0 0 0 0 0 17.21 0 0 19.09 0 20.49 0 Велики Борак 0 6.01 6.16 0 8.15 0 0 0 0 12.01 0 0 0 0 14.23 0 0 0 0 0 17.34 0 0 19.14 0 20.53 0 Барајево Центар 0 6.06 6.21 0 8.20 0 0 0 0 12.06 0 0 0 0 14.28 0 0 0 0 0 17.39 0 0 19.19 0 20.58 0 Барајево укр. 0 6.09 8.8 0 8.8 0 0 0 0 12.08 0 0 0 0 8.8 0 0 0 0 0 8.8 0 0 8.8 0 8.8 0 Бела река 0 6.17 6.31 0 8.29 0 0 0 0 12.16 0 0 0 0 14.38 0 0 0 0 0 17.48 0 0 19.33 0 21.08 0 Ресник 5.40 6.30 6.59 8.00 8.43 9.30 10.00 11.00 11.40 12.25 12.50 13.20 14.00 14.20 14.48 15.00 15.30 16.30 17.00 17.30 17.55 18.30 19.25 19.52 21.00 21.30 21.40 Кијево 5.43 6.33 7.02 8.03 8.47 9.33 10.03 11.03 11.43 12.28 12.53 13.23 14.03 14.23 14.52 15.03 15.33 16.33 17.03 17.33 17.58 18.33 19.28 19.55 21.03 21.33 21.43 Кнежевац 5.45 6.35 7.04 8.05 8.50 9.35 10.05 11.05 11.45 12.30 12.55 13.25 14.05 14.25 14.55 15.05 15.35 16.35 17.05 17.35 18.00 18.35 19.30 19.57 21.05 21.35 21.45 Раковица 5.49 6.39 7.07 8.09 8.54 9.39 10.09 11.09 11.49 12.34 12.59 13.29 14.09 14.29 15.01 15.09 15.39 16.39 17.09 17.39 18.04 18.39 19.34 10.01 21.09 21.39 21.49 Београд Центар 0 0 0 0 0 0 10.17 11.17 0 0 0 0 0 0 15.10 0 0 0 0 0 0 0 0 20.10 0 21.48 0 Нови Београд 0 0 0 0 0 0 0 0 0 0 0 0 0 0 15.14 0 0 0 0 0 0 0 0 20.14 0 21.52 0 Тошин Бунар 0 0 0 0 0 0 0 0 0 0 0 0 0 0 15.17 0 0 0 0 0 0 0 0 20.17 0 21.55 0 Земун 0 0 0 0 0 0 0 0 0 0 0 0 0 0 15.20 0 0 0 0 0 0 0 0 20.20 0 21.58 0 Карађорђев парк 5.57 6.47 7.15 8.17 9.02 9.47 0 0 11.57 12.42 13.07 13.37 14.17 14.37 0 15.17 15.47 16.47 17.17 17.47 18.12 18.47 19.42 0 21.17 0 21.57 Вуков споменик 6.01 6.51 7.18 8.21 9.06 9.51 0 0 12.01 12.46 13.11 13.41 14.21 14.41 0 15.21 15.51 16.51 17.21 17.51 18.16 18.51 19.46 0 21.21 0 22.01 Панчевачки мост 6.04 6.54 7.21 8.24 9.10 9.54 0 0 12.04 12.49 13.14 13.44 14.24 14.44 0 15.24 15.54 16.54 17.24 17.54 18.19 18.54 19.49 0 21.24 0 22.04 Крњача мост 6.08 6.58 7.25 8.28 9.14 9.58 0 0 12.08 12.53 13.18 13.48 14.28 14.48 0 15.28 15.58 16.58 17.28 17.58 18.23 18.58 19.53 0 21.28 0 22.08 Крњача укр. 6.11 7.01 7.27 8.31 9.17 10.01 0 0 12.11 12.56 13.21 13.51 14.31 14.51 0 15.31 16.01 17.01 17.31 18.01 18.26 19.01 19.56 0 21.31 0 22.11 Себеш 6.14 7.04 7.30 8.34 9.20 10.04 0 0 12.14 12.59 13.24 13.54 14.34 14.54 0 15.34 16.04 17.04 17.34 18.04 18.29 19.04 19.59 0 21.34 0 22.14 Овча 6.17 7.07 7.33 8.37 9.23 10.07 0 0 12.17 13.02 13.27 13.57 14.37 14.57 0 15.37 16.07 17.07 17.37 18.07 18.32 19.07 20.02 0 21.37 0 22.17",
  trainIdsDirection1: [7101, 7103, 8300, 8302, 7105, 8304, 8308, 8205, 8312, 8207, 7107, 8314, 8316, 8318, 8320, 8322, 7111, 7903, 7113, 8324, 8326, 8328, 7115, 8332, 8334, 8336, 8338, 8340],
  trainIdsDirection2: [8301, 7100, 7102, 8303, 7104, 8305, 8307, 8311, 8313, 7106, 8317, 8319, 8321, 8323, 7108, 8325, 8327, 8329, 8331, 8333, 7112, 8335, 7904, 7114, 8337, 7116, 8339],
  serviceFrequencyDirection1: ["ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed"],
  serviceFrequencyDirection2: ["ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed", "ed"]
}

// CURRENTLY OUT OF ORDER
// export const ovcaZemunResnikMladenovac: ARouteExtractedData = {
//   stationNames: ["ovca", "sebes", "krnjaca ukr", "krnjaca most", "pancevacki most", "vukov spomenik", "karadjordjev park", "zemun", "tosin bunar", "novi beograd", "beograd centar", "rakovica", "knezevac", "kijevo", "resnik", "ripanj kolonija", "ripanj", "klenje", "ripanj tunel", "ralja", "sopot kosmajski", "vlasko polje", "mladenovac"],
//   timetableDataDirection1: "Овча 0 15.52 Себеш 0 15.56 Крњача 0 16.00 Крњача мост 0 16.02 Панчевачки мост 0 16.08 Вуков споменик 0 16.11 Карађорђев парк 0 16.13 Земун 3.44 9.9 Тошин Бунар 3.47 9.9 Нови Београд 3.49 9.9 Београд Центар 3.54 9.9 Раковица 4.03 16.22 Кнежевац 4.06 16.25 Кијево 4.08 16.27 Ресник 4.11 16.31 Рипањ колонија 4.24 16.44 Рипањ 4.28 16.47 Клење 4.36 16.56 Рипањ тунел 4.48 17.08 Раља 4.59 17.20 Сопот Космајски 5.32 17.35 Влашко поље 5.38 17.42 Младеновац 5.43 17.48",
//   timetableDataDirection2: "Младеновац 6.20 18.07 Влашко Поље 6.26 18.13 Сопот Космајски 6.33 18.20 Раља 6.48 18.35 Рипањ тунел 6.59 18.47 Клење 7.09 18.58 Рипањ 7.18 19.07 Рипањ колонија 7.22 19.14 Ресник 7.35 19.25 Кијево 7.38 19.28 Кнежевац 7.40 19.30 Раковица 7.43 19.34 Београд Центар 9.9 9.9 Нови Београд 9.9 9.9 Тошин Бунар 9.9 9.9 Земун 9.9 9.9 Карађорђев парк 7.51 19.42 Вуков споменик 7.54 19.46 Панчевачки мост 7.57 19.49 Крњача мост 8.02 19.53 Крњача 8.05 19.56 Себеш 8.08 19.59 Овча 8.11 20.02",
//   trainIdsDirection1: [7901, 7903],
//   trainIdsDirection2: [7902, 7904],
//   serviceFrequencyDirection1: ["ed", "ed"],
//   serviceFrequencyDirection2: ["ed", "ed"]
// }

export const stationNamesDisplayMap: {[key in StationName]: StationNameDisplay} = {
  "batajnica": "Batajnica",
  "kamendin": "Kamendin",
  "zemunsko polje": "Zemunsko polje",
  "altina": "Altina",
  "zemun": "Zemun",
  "tosin bunar": "Tošin bunar",
  "novi beograd": "Novi Beograd",
  "beograd centar": "Beograd centar",
  "karadjordjev park": "Karađorđev park",
  "vukov spomenik": "Vukov spomenik",
  "pancevacki most": "Pančevački most",
  "krnjaca most": "Krnjača most",
  "krnjaca ukr": "Krnjača ukr.",
  "sebes": "Sebeš",
  "ovca": "Ovča",
  "rakovica": "Rakovica",
  "knezevac": "Kneževac",
  "kijevo": "Kijevo",
  "resnik": "Resnik",
  "ripanj kolonija": "Ripanj kolonija",
  "ripanj": "Ripanj",
  "klenje": "Klenje",
  "ripanj tunel": "Ripanj tunel",
  "ralja": "Ralja",
  "sopot kosmajski": "Sopot Kosmajski",
  "vlasko polje": "Vlaško Polje",
  "mladenovac": "Mladenovac",
  "bela reka": "Bela reka",
  "barajevo ukr": "Barajevo ukr.",
  "barajevo centar": "Barajevo Centar",
  "veliki borak": "Veliki Borak",
  "leskovac kolubarski": "Leskovac Kolubarski",
  "stepojevac": "Stepojevac",
  "vreoci": "Vreoci",
  "lazarevac": "Lazarevac"
}

